ARMmbed/mbed-hal-st-stm32f4/source/serial_api.c
    if (HAL_UART_Init(handle) != HAL_OK) {
           error("Cannot set UART%u baudrate\n", SERIAL_OBJ(module+1));
    }
    
    DEBUG_PRINTF("UART%u: Baudrate: %u\n", SERIAL_OBJ(module+1), baudrate);
}

void serial_format(serial_t *obj, int data_bits, SerialParity parity, int stop_bits)
{
    UART_HandleTypeDef *handle = &UartHandle[SERIAL_OBJ(module)];
  
    if (data_bits == 9) {
        handle->Init.WordLength = UART_WORDLENGTH_9B;
    } else {
        handle->Init.WordLength = UART_WORDLENGTH_8B;
    }

    switch (parity) {
        case ParityOdd:
            handle->Init.Parity = UART_PARITY_ODD;
            break;
        case ParityEven:
            handle->Init.Parity = UART_PARITY_EVEN;
            break;
        default: // ParityNone
        case ParityForced0: // unsupported!
        case ParityForced1: // unsupported!
            handle->Init.Parity = UART_PARITY_NONE;
            break;
    }

    if (stop_bits == 2) {
        handle->Init.StopBits = UART_STOPBITS_2;
    } else {
        handle->Init.StopBits = UART_STOPBITS_1;
    }

    if (HAL_UART_Init(handle) != HAL_OK) {
           error("Cannot format UART%u\n", SERIAL_OBJ(module+1));
    }

    DEBUG_PRINTF("UART%u: Format: %u, %u, %u\n", SERIAL_OBJ(module+1), data_bits, parity, stop_bits);
}

/******************************************************************************
 * INTERRUPTS HANDLING
 ******************************************************************************/

static void uart_irq(int id)
{
  UART_HandleTypeDef *handle = &UartHandle[id];
    if (serial_irq_ids[id] != 0) {
        if (__HAL_UART_GET_FLAG(handle, UART_FLAG_TC) != RESET) {
            irq_handler(serial_irq_ids[id], TxIrq);
            __HAL_UART_CLEAR_FLAG(handle, UART_FLAG_TC);
        }
        if (__HAL_UART_GET_FLAG(handle, UART_FLAG_RXNE) != RESET) {
            irq_handler(serial_irq_ids[id], RxIrq);
            __HAL_UART_CLEAR_FLAG(handle, UART_FLAG_RXNE);
        }
    }
}

#if DEVICE_SERIAL_ASYNCH_DMA
static void dma_irq(DMAName name, int id, SerialIrq txrxirq)
{

  if (serial_irq_ids[id] != 0) {
    if (txrxirq == RxIrq) {
      if (__HAL_DMA_GET_TC_FLAG_INDEX(&DmaHandle) != RESET) {
            irq_handler(serial_irq_ids[id], RxIrq);
            __HAL_DMA_CLEAR_FLAG(&DmaHandle, DMA_FLAG_TCIF2_6);
        }
    } else {
      if (__HAL_DMA_GET_TC_FLAG_INDEX(&DmaHandle) != RESET) {
            irq_handler(serial_irq_ids[id], TxIrq);
            __HAL_DMA_CLEAR_FLAG(&DmaHandle, DMA_FLAG_TCIF0_4);
        }
    }    
  }
    DmaHandle.Instance = (DMA_Stream_TypeDef *)name;
    if (serial_irq_ids[id] != 0) {
        if (__HAL_DMA_GET_TC_FLAG_INDEX(&DmaHandle) != RESET) {
            irq_handler(serial_irq_ids[id], TxIrq);
            __HAL_DMA_CLEAR_FLAG(&DmaHandle, DMA_FLAG_TCIF0_4);
        }
        if (__HAL_DMA_GET_TC_FLAG_INDEX(&DmaHandle) != RESET) {
            irq_handler(serial_irq_ids[id], RxIrq);
            __HAL_DMA_CLEAR_FLAG(&DmaHandle, DMA_FLAG_TCIF2_6);
        }
    }
}
#endif
// DEVICE_SERIAL_ASYNCH_DMA

static void uart1_irq(void)
{
    uart_irq(0);
}

#if defined(USART2_BASE)
static void uart2_irq(void)
{
    uart_irq(1);
}
#endif

#if defined(USART3_BASE)
static void uart3_irq(void)
{
    uart_irq(2);
}
#endif

#if defined(UART4_BASE)
static void uart4_irq(void)
{
    uart_irq(3);
}
#endif

#if DEVICE_SERIAL_ASYNCH_DMA

#if defined(UART5_BASE)
static void dma1_stream0_irq(void)
{
    dma_irq(DMA_1, 4, RxIrq); // uart5_rx
}
#endif

#if defined(USART3_BASE)
static void dma1_stream1_irq(void)
{
    dma_irq(DMA_1, 2, RxIrq); // uart3_rx
}
#endif

#if defined(UART4_BASE)
static void dma1_stream2_irq(void)
{
    dma_irq(DMA_1, 3, RxIrq); // uart4_rx
}
#endif

#if defined(USART3_BASE)
static void dma1_stream3_irq(void)
{
    dma_irq(DMA_1, 2, TxIrq); // uart3_tx
}
#endif

#if defined(UART4_BASE)
static void dma1_stream4_irq(void)
{
    dma_irq(DMA_1, 3, TxIrq); // uart4_tx
}
#endif

#if defined(USART2_BASE)
static void dma1_stream5_irq(void)
{
    dma_irq(DMA_1, 1, RxIrq); // uart2_rx
}
#endif

#if defined(USART2_BASE)
static void dma1_stream6_irq(void)
{
    dma_irq(DMA_1, 1, TxIrq); // uart2_tx
}
#endif

#if defined(UART5_BASE)
static void dma1_stream7_irq(void)
{
    dma_irq(DMA_1, 4, TxIrq); // uart5_tx
}
#endif

#if defined(USART6_BASE)
static void dma2_stream1_irq(void)
{
    dma_irq(DMA_2, 5, RxIrq); // uart6_rx
}
#endif

static void dma2_stream5_irq(void)
{
    dma_irq(DMA_2, 0, RxIrq); // uart1_rx
}

#if defined(USART6_BASE)
static void dma2_stream6_irq(void)
{
    dma_irq(DMA_2, 5, TxIrq); // uart6_tx
}
#endif

static void dma2_stream7_irq(void)
{
    dma_irq(DMA_2, 0, TxIrq); // uart1_tx
}

#endif
// DEVICE_SERIAL_ASYNCH_DMA

#if defined(UART5_BASE)
static void uart5_irq(void)
{
    uart_irq(4);
}
#endif

#if defined(USART6_BASE)
static void uart6_irq(void)
{
    uart_irq(5);
}
#endif

#if defined(UART7_BASE)
static void uart7_irq(void)
{
    uart_irq(6);
}
#endif

#if defined(UART8_BASE)
static void uart8_irq(void)
{
    uart_irq(7);
}
#endif

void serial_irq_handler(serial_t *obj, uart_irq_handler handler, uint32_t id)
{
    irq_handler = handler;
    serial_irq_ids[SERIAL_OBJ(module)] = id;
}

void serial_irq_set(serial_t *obj, SerialIrq irq, uint32_t enable)
{
    IRQn_Type irq_n = (IRQn_Type)0;
    uint32_t vector = 0;
#if DEVICE_SERIAL_ASYNCH_DMA
    IRQn_Type irqn_dma = (IRQn_Type)0;
    uint32_t vector_dma = 0;
#endif

    UART_HandleTypeDef *handle = &UartHandle[SERIAL_OBJ(module)];

    switch (SERIAL_OBJ(module)) {
        case 0:
            irq_n = USART1_IRQn;
            vector = (uint32_t)&uart1_irq;
#if DEVICE_SERIAL_ASYNCH_DMA
            if (irq == RxIrq) {
                irqn_dma = DMA2_Stream5_IRQn;
                vector_dma = (uint32_t)&dma2_stream5_irq;
            } else {
                irqn_dma = DMA2_Stream7_IRQn;
                vector_dma = (uint32_t)&dma2_stream7_irq;
            }
#endif
            break;

        case 1:
            irq_n = USART2_IRQn;
            vector = (uint32_t)&uart2_irq;
#if DEVICE_SERIAL_ASYNCH_DMA
            if (irq == RxIrq) {
                irqn_dma = DMA1_Stream5_IRQn;
                vector_dma = (uint32_t)&dma1_stream5_irq;
            } else {
                irqn_dma = DMA1_Stream6_IRQn;
                vector_dma = (uint32_t)&dma1_stream6_irq;
            }
#endif
            break;
#if defined(USART3_BASE)
        case 2:
            irq_n = USART3_IRQn;
            vector = (uint32_t)&uart3_irq;
#if DEVICE_SERIAL_ASYNCH_DMA
            if (irq == RxIrq) {
                irqn_dma = DMA1_Stream1_IRQn;
                vector_dma = (uint32_t)&dma1_stream1_irq;
            } else {
                irqn_dma = DMA1_Stream3_IRQn;
                vector_dma = (uint32_t)&dma1_stream3_irq;
            }
#endif
            break;
#endif
#if defined(UART4_BASE)
        case 3:
            irq_n = UART4_IRQn;
            vector = (uint32_t)&uart4_irq;
#if DEVICE_SERIAL_ASYNCH_DMA
            if (irq == RxIrq) {
                irqn_dma = DMA1_Stream2_IRQn;
                vector_dma = (uint32_t)&dma1_stream2_irq;
            } else {
                irqn_dma = DMA1_Stream4_IRQn;
                vector_dma = (uint32_t)&dma1_stream4_irq;
            }
#endif
            break;
#endif
#if defined(UART5_BASE)
        case 4:
            irq_n = UART5_IRQn;
            vector = (uint32_t)&uart5_irq;
#if DEVICE_SERIAL_ASYNCH_DMA
            if (irq == RxIrq) {
                irqn_dma = DMA1_Stream0_IRQn;
                vector_dma = (uint32_t)&dma1_stream0_irq;
            } else {
                irqn_dma = DMA1_Stream4_IRQn;
                vector_dma = (uint32_t)&dma1_stream7_irq;
            }
#endif
            break;
#endif
#if defined(USART6_BASE)
        case 5:
            irq_n = USART6_IRQn;
            vector = (uint32_t)&uart6_irq;
#if DEVICE_SERIAL_ASYNCH_DMA
            if (irq == RxIrq) {
                irqn_dma = DMA2_Stream1_IRQn;
                vector_dma = (uint32_t)&dma2_stream1_irq;
            } else {
                irqn_dma = DMA2_Stream6_IRQn;
                vector_dma = (uint32_t)&dma2_stream6_irq;
            }
#endif
            break;
#endif
#if defined(UART7_BASE)
        case 6:
            irq_n = UART7_IRQn;
            vector = (uint32_t)&uart7_irq;
            break;
#endif
#if defined(UART8_BASE)
        case 7:
            irq_n = UART8_IRQn;
            vector = (uint32_t)&uart8_irq;
            break;
#endif
    }

    if (enable) {

        if (irq == RxIrq) {
            __HAL_UART_ENABLE_IT(handle, UART_IT_RXNE);
#if DEVICE_SERIAL_ASYNCH_DMA
            NVIC_SetVector(irq_n, vector_dma);
            NVIC_EnableIRQ(irq_n);
            NVIC_SetVector(irqn_dma, vector_dma);
            NVIC_EnableIRQ(irqn_dma);
#else
            NVIC_SetVector(irq_n, vector);
            NVIC_EnableIRQ(irq_n);
#endif
        } else { // TxIrq
            __HAL_UART_ENABLE_IT(handle, UART_IT_TC);
            NVIC_SetVector(irq_n, vector);
            NVIC_EnableIRQ(irq_n);
#if DEVICE_SERIAL_ASYNCH_DMA
            NVIC_SetVector(irqn_dma, vector_dma);
            NVIC_EnableIRQ(irqn_dma);
#endif
        }
    } else { // disable

