ARMmbed/mbed-hal-st-stm32f4/source/serial_api.c
    //RX PART
    // increment rx_buff.pos
    if (handle->RxXferSize != 0) {
        obj->rx_buff.pos = handle->RxXferSize - handle->RxXferCount;
    }
    
    if ((handle->RxXferCount == 0) && (obj->rx_buff.pos >= (obj->rx_buff.length - 1))) {
        return_event |= SERIAL_EVENT_RX_COMPLETE & SERIAL_OBJ(events);
    }
    
    // Check if char_match is present
    if (SERIAL_OBJ(events) & SERIAL_EVENT_RX_CHARACTER_MATCH) {
      if (buf != NULL){
        while((buf[i] != obj->char_match) && (i < handle->RxXferSize)){
          i++;
        }
        if (i < handle->RxXferSize){
            obj->rx_buff.pos = i;
            return_event |= SERIAL_EVENT_RX_CHARACTER_MATCH & SERIAL_OBJ(events);
        }
      }
    }
    
    return return_event;  
}

/** Abort the ongoing TX transaction. It disables the enabled interupt for TX and
 *  flush TX hardware buffer if TX FIFO is used
 *
 * @param obj The serial object
 */
void serial_tx_abort_asynch(serial_t *obj)
{
    UART_HandleTypeDef *handle = &UartHandle[SERIAL_OBJ(module)];
    __HAL_UART_DISABLE_IT(handle, UART_IT_TC|UART_IT_TXE);
    // clear flags
    __HAL_UART_CLEAR_PEFLAG(handle);
    // reset states
    handle->TxXferCount = 0;
    // update handle state
    if(handle->State == HAL_UART_STATE_BUSY_TX_RX) {
        handle->State = HAL_UART_STATE_BUSY_RX;
    } else {
        handle->State = HAL_UART_STATE_READY;
    }
}

/** Abort the ongoing RX transaction It disables the enabled interrupt for RX and
 *  flush RX hardware buffer if RX FIFO is used
 *
 * @param obj The serial object
 */
void serial_rx_abort_asynch(serial_t *obj)
{
    UART_HandleTypeDef *handle = &UartHandle[SERIAL_OBJ(module)];
    __HAL_UART_DISABLE_IT(handle, UART_IT_RXNE);
    // clear flags
    __HAL_UART_CLEAR_PEFLAG(handle);
    // reset states
    handle->RxXferCount = 0;
    // update handle state
    if(handle->State == HAL_UART_STATE_BUSY_TX_RX) {
        handle->State = HAL_UART_STATE_BUSY_TX;
    } else {
        handle->State = HAL_UART_STATE_READY;
    }
}

#endif
// DEVICE_SERIAL_ASYNCH

#if DEVICE_SERIAL_FC
/** Set HW Control Flow
 * @param obj    The serial object
 * @param type   The Control Flow type (FlowControlNone, FlowControlRTS, FlowControlCTS, FlowControlRTSCTS)
 * @param rxflow Pin for the rxflow
 * @param txflow Pin for the txflow
 */
void serial_set_flow_control(serial_t *obj, FlowControl type, PinName rxflow, PinName txflow)
{
    // Determine the UART to use (UART_1, UART_2, ...)
    UARTName uart_rts = (UARTName)pinmap_peripheral(rxflow, PinMap_UART_RTS);
    UARTName uart_cts = (UARTName)pinmap_peripheral(txflow, PinMap_UART_CTS);

    // Get the peripheral name (UART_1, UART_2, ...) from the rts/cts pins
    UARTName uart_rtscts = (UARTName)pinmap_merge(uart_cts, uart_rts);
    MBED_ASSERT(uart_rtscts != (UARTName)NC);
    // Check if the same UART is used
    if ((UARTName)(UartHandle[SERIAL_OBJ(module)].Instance) != uart_rtscts) {
        error("UART%u flow control pins are not correct\n", SERIAL_OBJ(module+1));
    }
    
    // Configure UART
    UART_HandleTypeDef *handle = &UartHandle[SERIAL_OBJ(module)];

    switch (type) {
        case FlowControlRTS:
            MBED_ASSERT(uart_rts != (UARTName)NC);
            // Enable the pin for RTS function
            pinmap_pinout(rxflow, PinMap_UART_RTS);
            handle->Init.HwFlowCtl = UART_HWCONTROL_RTS;
            break;
        case FlowControlCTS:
            MBED_ASSERT(uart_cts != (UARTName)NC);
            // Enable the pin for CTS function
            pinmap_pinout(txflow, PinMap_UART_CTS);
            handle->Init.HwFlowCtl = UART_HWCONTROL_CTS;
            break;
        case FlowControlRTSCTS:
            MBED_ASSERT(uart_rts != (UARTName)NC);
            MBED_ASSERT(uart_cts != (UARTName)NC);
            // Enable the pins for RTS and CTS functions
            pinmap_pinout(rxflow, PinMap_UART_RTS);
            pinmap_pinout(txflow, PinMap_UART_CTS);
            handle->Init.HwFlowCtl = UART_HWCONTROL_RTS_CTS;
            break;
        case FlowControlNone:
        default:
            handle->Init.HwFlowCtl = UART_HWCONTROL_NONE;
            break;
    }
    
    if (HAL_UART_Init(handle) != HAL_OK) {
        error("Cannot set UART%u flow control\n", SERIAL_OBJ(module+1));
    }
    
    DEBUG_PRINTF("UART%u: flow control set\n", SERIAL_OBJ(module+1));
}
#endif
// DEVICE_SERIAL_FC

#endif
// DEVICE_SERIAL
